example-advanced/figures/dabs_visualization/puml/dev.puml
@startuml
!theme plain
package "mlops_stacks - dev (mode: development)\n(host: https://adb-xxxx.xx.azuredatabricks.net)" {
  package "Jobs" as Jobs_dev {
    rectangle "dev-mlops_stacks-batch-inference-job\nnotify on_failure: first@company.com, second@company.com" as jobs_batch_inference_job_dev
    package "Workflow" as Workflow_batch_inference_job_dev {
      jobs_batch_inference_job_dev --> Workflow_batch_inference_job_dev : contains
      package "batch_inference_job\n(notebook)" as task_batch_inference_job_batch_inference_job_dev {
        rectangle "env\ninput_table_name\noutput_table_name\nmodel_name\ngit_source_info\n" as git_source_info_parameters_task_batch_inference_job_batch_inference_job_dev
      }
    }
    rectangle "Cluster: batch_inference_job_cluster\n13.3.x-cpu-ml-scala2.12, m7g.large, " as job_cluster_batch_inference_job_batch_inference_job_cluster_dev
    jobs_batch_inference_job_dev --> job_cluster_batch_inference_job_batch_inference_job_cluster_dev : uses
    rectangle "dev-mlops_stacks-model-training-job" as jobs_model_training_job_dev
    package "Workflow" as Workflow_model_training_job_dev {
      jobs_model_training_job_dev --> Workflow_model_training_job_dev : contains
      package "Train\n(notebook)" as task_model_training_job_Train_dev {
        rectangle "env\ntraining_data_path\nexperiment_name\nmodel_name\ngit_source_info\n" as git_source_info_parameters_task_model_training_job_Train_dev
      }
      package "ModelValidation\n(notebook)" as task_model_training_job_ModelValidation_dev {
      task_model_training_job_Train_dev --> task_model_training_job_ModelValidation_dev : depends on
        rectangle "experiment_name\nrun_mode\nenable_baseline_comparison\nvalidation_input\nmodel_type\ntargets\ncustom_metrics_loader_function\nvalidation_thresholds_loader_function\nevaluator_config_loader_function\ngit_source_info\n" as git_source_info_parameters_task_model_training_job_ModelValidation_dev
      }
      package "ModelDeployment\n(notebook)" as task_model_training_job_ModelDeployment_dev {
      task_model_training_job_ModelValidation_dev --> task_model_training_job_ModelDeployment_dev : depends on
        rectangle "env\ngit_source_info\n" as git_source_info_parameters_task_model_training_job_ModelDeployment_dev
      }
    }
    rectangle "Cluster: model_training_job_cluster\n13.3.x-cpu-ml-scala2.12, Standard_D3_v2, " as job_cluster_model_training_job_model_training_job_cluster_dev
    jobs_model_training_job_dev --> job_cluster_model_training_job_model_training_job_cluster_dev : uses
  }
}
@enduml
